"""შექმენით სია 10 ელემენტით (რიცხვებითა და სტრინგებით). შეცვალეთ პირველი და ბოლო ელემენტი ახალი მნიშვნელობებით, შემდეგ დაბეჭდეთ შეცვლილი სია.

შექმენით სია და გამოიყენეთ append() და insert() ფუნქციები, რომ დაამატოთ 3 ახალი ელემენტი სიის ბოლოში და 1 ელემენტი მესამე პოზიციაზე. დაბეჭდეთ საბოლოო სია.

შექმენით სია მინიმუმ 8 რიცხვით. წაშალეთ ერთ-ერთი ელემენტი მნიშვნელობის მიხედვით (remove()), შემდეგ წაშალეთ სხვა ელემენტი ინდექსის მიხედვით (pop()), და დაბეჭდეთ შედეგი.

შექმენით ორი სია რიცხვებით და გააერთიანეთ ისინი ერთ სიად. მიღებულ სიაზე გამოთვალეთ მაქსიმალური, მინიმალური და ჯამური მნიშვნელობა.

შექმენით სია 10 ელემენტით. დაბეჭდეთ მხოლოდ ის ელემენტები, რომლებიც მეორე ინდექსიდან მერვემდეა (მერვე არ ჩათვლით), შემდეგ დაბეჭდეთ ბოლო სამი ელემენტი ცალ-ცალკე."""



#დავალება 1

sia = [1, 2, 3, "გიორგი", 5, 6, "ილია", 8, 9, 10]

sia[0] = "პირველი"
sia[-1] = "ბოლო"

print(sia)

#დავალება 2

sia = [1, 2, 3, 4, 5]

sia.append("ბოლო1")
sia.append("ბოლო2")
sia.append("ბოლო3")

sia.insert(2, "მესამე")

print(sia)


#დავალება 3

sia = [10, 20, 30, 40, 50, 60, 70, 80]

sia.remove(30)

sia.pop(2)

print(sia)

#დავალება 4

sia1 = [1, 2, 3, 4, 5]
sia2 = [6, 7, 8, 9, 10]

gaertianeuli = sia1 + sia2

print("გაერთიანებული სია:", gaertianeuli)
print("მაქსიმალური:", max(gaertianeuli))
print("მინიმალური:", min(gaertianeuli))
print("ჯამი:", sum(gaertianeuli))


#დავალება 5

sia = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

print("მე-2 დან მე-8 მდე:", sia[2:8])

print("ბოლო სამი ელემენტი:")
print(sia[-3])
print(sia[-2])
print(sia[-1])
