"""1) შექმენით ორი სია და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც ორივე სიაში გვხვდება.

2)იპოვეთ სიის მეორე მაქსიმუმი და მინიმუმი.

3) შეაბრუნეთ სია ისე, რომ ბოლო ელემენტი გახდეს პირველი და მეორე ბოლო გახდეს მეორე და ა.შ. (reverse-ის გარეშე)

4)შექმენით სია და გაანაცვლეთ მინიმალური და მაქსიმალური ელემენტების ადგილები.

5)შექმენით სია 10 რიცხვით და დაბეჭდეთ მხოლოდ ის რიცხვები, რომლებიც უფრო დიდია სიის საშუალო მნიშვნელობაზე.

ბონუსი: 2 დავალება არანაირი ჩაშენებული ფუნქციის გამოყენებით. 

შექმენით სია და გამოთვალე რამდენჯერ იცვლება ზრდადობა ან კლებადობა (მაგ. 2→5 – იზრდება, 5→3 – კლებულობს).

შექმენით სია და გადაიტანეთ ორ ახალ სიაში ისე, რომ ყველა ლუწი რიცხვი იყოს ახალ ერთ მასივში და მეორე კენტ მასივში."""

#დავალება 1

sia1 = [1, 2, 3, 4, 5]
sia2 = [3, 4, 5, 6, 7]

for i in sia1:
    if i in sia2:
        print(i)

#დავალება 2

sia = [10, 20, 30, 40, 50]

dasortirebi = sorted(sia)

print("მეორე მინიმუმი:", dasortirebi[1])
print("მეორე მაქსიმუმი:", dasortirebi[-2])


#დავალება 3

sia = [1, 2, 3, 4, 5]
axali_sia = []

i = len(sia) - 1
while i >= 0:
    axali_sia.append(sia[i])
    i = i - 1

print(axali_sia)


#დავალება 4

sia = [10, 20, 30, 40, 50]

min_index = sia.index(min(sia))
max_index = sia.index(max(sia))

sia[min_index], sia[max_index] = sia[max_index], sia[min_index]

print(sia)


#დავალება 5

sia = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

sashualo = sum(sia) / len(sia)
print("საშუალო:", sashualo)

for i in sia:
    if i > sashualo:
        print(i)
