"""1)შექმენით tuple რომელიც შეიცავს 5 ქალაქის სახელს. დაწერეთ კოდი რომელიც:

დაბეჭდავს tuple-ის სიგრძეს
დაბეჭდავს პირველ და ბოლო ელემენტს
შეამოწმებს არის თუ არა "თბილისი" tuple-ში
 
2)შექმენით tuple სამი სტუდენტის ქულებით: (85, 92, 78). გამოიყენეთ unpacking-ი რათა თითოეული ქულა ცალკე ცვლადში ჩაიწეროს და დაბეჭდეთ მათი საშუალო არითმეტიკული.

 
3)შექმენით tuple რომელიც შეიცავს 3 პიროვნების ინფორმაციას (სახელი, ასაკი, ქალაქი) - თითოეული პიროვნება ცალკე tuple-ია. დაწერეთ კოდი რომელიც გაივლის ყველა პიროვნებას და დაბეჭდავს მათ ინფორმაციას ფორმატირებული სახით.

 
4)შექმენით tuple რომელიც შეიცავს რიცხვებს (შეიძლება გამეორებები იყოს): (5, 2, 8, 2, 9, 2, 3, 2). გამოიყენეთ tuple-ის მეთოდები რათა:

იპოვოთ რამდენჯერ გვხვდება რიცხვი 2
იპოვოთ რიცხვი 8-ის ინდექსი
5)შექმენით tuple original = (1, 2, 3, 4, 5). დაწერეთ კოდი რომელიც შექმნის ახალ tuple-ს სადაც:

ყველა ელემენტი გამრავლებული იქნება 2-ზე
დაემატება ახალი ელემენტი ბოლოში.
ბონუსი:

დაწერეთ კოდი რომელიც იღებს ნებისმიერი სიღრმის ჩადგმულ ლისტს და აბრუნებს მას გაბრტყელებულ (ერთგანზომილებიან) ლისტად.

 
 
nested = [1, [2, 3, [4, 5]], 6, [7, [8, 9]]]
# შედეგი უნდა იყოს: [1, 2, 3, 4, 5, 6, 7, 8, 9]

nested2 = [[1, 2], [3, [4, [5, 6]]], 7]
# შედეგი: [1, 2, 3, 4, 5, 6, 7]"""


#დავალება 1

kalakebi = ("თბილისი", "ბათუმი", "ქუთაისი", "რუსთავი", "გორი")

print("სიგრძე:", len(kalakebi))
print("პირველი:", kalakebi[0])
print("ბოლო:", kalakebi[-1])

if "თბილისი" in kalakebi:
    print("თბილისი tuple-შია!")
else:
    print("თბილისი tuple-ში არ არის!")

#დავალება 2

qulebi = (85, 92, 78)

qula1, qula2, qula3 = qulebi

sashualo = (qula1 + qula2 + qula3) / 3

print("პირველი ქულა:", qula1)
print("მეორე ქულა:", qula2)
print("მესამე ქულა:", qula3)
print("საშუალო:", sashualo)


#დავალება 3

pirovnebi = (
    ("გიორგი", 25, "თბილისი"),
    ("ანა", 30, "ბათუმი"),
    ("დავითი", 22, "ქუთაისი")
)

for pirovneba in pirovnebi:
    saxeli, asaki, kalaki = pirovneba
    print("სახელი:", saxeli)
    print("ასაკი:", asaki)
    print("ქალაქი:", kalaki)
    print("---")

#დავალება 4


ricxvebi = (5, 2, 8, 2, 9, 2, 3, 2)

raodanoba = ricxvebi.count(2)
print("2 გვხვდება:", raodanoba, "ჯერ")

indexi = ricxvebi.index(8)
print("8-ის ინდექსი:", indexi)

#დავალება 5

original = (1, 2, 3, 4, 5)

axali = tuple(i * 2 for i in original)

axali = axali + (100,)

print("ახალი tuple:", axali)


