"""1)დაწერეთ პროგრამა, რომელიც:

შექმნის ორ ცვლადს a=15 და b=4
დაბეჭდავს მათ ჯამს, სხვაობას, ნამრავლს და განაყოფს
დაბეჭდავს a-ს გაყოფას b-ზე განაყოფისა და ნაშთის სახით (გამოიყენეთ // და %)
დაბეჭდავს a-ს b-ის ხარისხში (** ოპერატორით)
 
2)დაწერეთ პროგრამა, რომელიც:

შექმნის ცვლადს first_name="ანა"
შექმნის ცვლადს last_name="გელაშვილი"
შექმნის ცვლადს full_name, რომელიც იქნება ამ ორი სახელის გაერთიანება (შორის ჰარით)
დაბეჭდავს სრულ სახელს
 
3)დაწერეთ პროგრამა, რომელიც:

შექმნის ცვლადს number1="25" (სტრინგი)
შექმნის ცვლადს number2="30" (სტრინგი)
დაბეჭდავს მათ კონკატენაციას (უბრალოდ დამატებას)
გარდაქმნის ორივეს integer-ად და დაბეჭდავს მათემატიკურ ჯამს
 
4)დაწერეთ პროგრამა, რომელიც:

სთხოვს მომხმარებელს შეიყვანოს თავისი სახელი
სთხოვს შეიყვანოს ასაკი
სთხოვს შეიყვანოს საყვარელი ქალაქი
დაბეჭდავს შეტყობინებას: "გამარჯობა [სახელი]! შენ ხარ [ასაკი] წლის და შენი საყვარელი ქალაქია [ქალაქი]."
 
5)დაწერეთ პროგრამა, რომელიც:

სთხოვს მომხმარებელს შეიყვანოს პირველი რიცხვი
სთხოვს შეიყვანოს მეორე რიცხვი
გამოთვლის და დაბეჭდავს:
მათ ჯამს
მათ სხვაობას
მათ ნამრავლს
მათ განაყოფს (ჩვეულებრივი / ოპერატორით)
ყველა შედეგი დაბეჭდეთ ცალ-ცალკე, ნათელი ტექსტით"""



#დავალება 1

a = 15
b = 4

print("ჯამი:", a + b)
print("სხვაობა:", a - b)
print("ნამრავლი:", a * b)
print("განაყოფი:", a / b)
print("მთელი განაყოფი:", a // b)
print("ნაშთი:", a % b)
print("ხარისხი:", a ** b)

#დავალება 2

first_name = "ილია"
last_name = "გოგავა"
full_name = first_name + " " + last_name

print("სრული სახელი:", full_name)

#დავალება 3

number1 = "25"
number2 = "30"

print("კონკატენაცია:", number1 + number2)

print("მათემატიკური ჯამი:", int(number1) + int(number2))

#დავალება 4


saxeli = input("შეიყვანე შენი სახელი: ")
asaki = input("შეიყვანე შენი ასაკი: ")
kalaki = input("შეიყვანე შენი საყვარელი ქალაქი: ")

print("გამარჯობა " + saxeli + "! შენ ხარ " + asaki + " წლის და შენი საყვარელი ქალაქია " + kalaki + ".")

#დავალება 5

ricxvi1 = int(input("შეიყვანე პირველი რიცხვი: "))
ricxvi2 = int(input("შეიყვანე მეორე რიცხვი: "))

print("ჯამი:", ricxvi1 + ricxvi2)
print("სხვაობა:", ricxvi1 - ricxvi2)
print("ნამრავლი:", ricxvi1 * ricxvi2)
print("განაყოფი:", ricxvi1 / ricxvi2)

