"""1)მომხმარებელი შეიყვანს რიცხვს. პროგრამამ უნდა შეამოწმოს და დაბეჭდოს:

არის თუ არა რიცხვი დადებითი
არის თუ არა უარყოფითი
არის თუ არა ნული
2)მომხმარებელი შეიყვანს ტემპერატურას. პროგრამამ უნდა დაბეჭდოს:

30-ზე მეტი: "ძალიან ცხელა"
20-30: "თბილა"
10-20: "გრილია"
10-ზე ნაკლები: "ცივა"
3)დაწერეთ პროგრამა, რომელიც შეამოწმებს ლუწია თუ კენტი რიცხვი.

4)დაწერეთ პროგრამა, რომელიც ამოწმებს კინოში ბილეთის ფასს ასაკის მიხედვით:

5 წლამდე ბავშვები: უფასო
5-12 წლის ბავშვები: 5 ლარი
13-17 წლის მოზარდები: 8 ლარი
18+ ზრდასრულები: 12 ლარი
65+ პენსიონერები: 6 ლარი"""

#დავალება 1

ricxvi = int(input("შეიყვანე რიცხვი: "))

if ricxvi > 0:
    print("რიცხვი დადებითია")
elif ricxvi < 0:
    print("რიცხვი უარყოფითია")
else:
    print("რიცხვი ნულია")

#დავალება 2

temperatura = int(input("შეიყვანე ტემპერატურა: "))

if temperatura > 30:
    print("ძალიან ცხელა")
elif temperatura >= 20:
    print("თბილა")
elif temperatura >= 10:
    print("გრილია")
else:
    print("ცივა")


#დავალება 3

ricxvi = int(input("შეიყვანე რიცხვი: "))

if ricxvi % 2 == 0:
    print("რიცხვი ლუწია")
else:
    print("რიცხვი კენტია")

#დავალება 4

asaki = int(input("შეიყვანე ასაკი: "))

if asaki < 5:
    print("ბილეთი უფასოა")
elif asaki <= 12:
    print("ბილეთის ფასია: 5 ლარი")
elif asaki <= 17:
    print("ბილეთის ფასია: 8 ლარი")
elif asaki >= 65:
    print("ბილეთის ფასია: 6 ლარი")
else:
    print("ბილეთის ფასია: 12 ლარი")
