"""1) დაწერეთ პროგრამა, რომელიც:

while ციკლით სთხოვს მომხმარებელს პროდუქტის ფასების შეყვანას.

თუ შეიყვანა 0: პროგრამა დასრულდეს და ჯამი დაიბეჭდოსთითოეული ფასისთვის:

თუ ფასი < 0: დაბეჭდეთ "შეცდომა! ფასი უარყოფითი არ შეიძლება" და ნუ დაემატება ჯამს

თუ ფასი > 0: დაამატეთ ჯამს

ბოლოს დაბეჭდეთ:

საერთო ჯამი

თუ ჯამი > 100: დაბეჭდეთ "თქვენ მიიღეთ 10% ფასდაკლება!" და ახალი ჯამი

2) დაწერეთ პროგრამა, რომელიც 1 დან 1000 მდე დაბეჭდავს 10 ის ჯერად რიცხვებს და დათვლის მათ რაოდენობას.

3)დაწერეთ პროგრამა, რომელიც დათვლის მომხმარებლის მიერ შეყვანილ დადებით რიცხვამდე 5 ის ჯერად რიცხვებს და დათვალეთ მათი რაოდენობა. უარყოფითი რიცხვის შეყვანის შემთხვევაში დაპრინტეთ შეცდომა.

ბონუსი: 2  დავალებაში დათვალეთ რამდენი რიცხვი დააკმაყოფილებს ამ პირობებს."""


#დავალება 1

jami = 0

while True:
    fasi = float(input("შეიყვანე ფასი (0 = დასასრული): "))
    
    if fasi == 0:
        break
    elif fasi < 0:
        print("შეცდომა! ფასი უარყოფითი არ შეიძლება")
    else:
        jami = jami + fasi

print("საერთო ჯამი:", jami)

if jami > 100:
    fasdakleba = jami * 0.10
    axali_jami = jami - fasdakleba
    print("თქვენ მიიღეთ 10% ფასდაკლება!")
    print("ახალი ჯამი:", axali_jami)


#დავალება 2

raodanoba = 0

for i in range(1, 1001):
    if i % 10 == 0:
        print(i)
        raodanoba = raodanoba + 1

print("რაოდენობა:", raodanoba)

#დავალება 3

ricxvi = int(input("შეიყვანე დადებითი რიცხვი: "))

if ricxvi < 0:
    print("შეცდომა! უარყოფითი რიცხვი არ შეიძლება")
else:
    raodanoba = 0
    
    for i in range(1, ricxvi + 1):
        if i % 5 == 0:
            print(i)
            raodanoba = raodanoba + 1
    
    print("5-ის ჯერადი რიცხვების რაოდენობა:", raodanoba)
 