"""1)მომხმარებელი შეიყვანს რიცხვებს. პროგრამამ უნდა დააჯამოს მხოლოდ დადებითი რიცხვები. როცა მომხმარებელი შეიყვანს 0-ს, პროგრამა უნდა გაჩერდეს და დაბეჭდოს ჯამი.

2)მომხმარებელს შეაყვანინეთ რიცხვი. დათვალეთ რამდენი ციფრი აქვს ამ რიცხვს.

3)კენტი და ლუწი რიცხვების დათვლა
მომხმარებელს შეაყვანინეთ რიცხვი N. დაბეჭდეთ:
- რამდენი კენტი რიცხვია 1-დან N-მდე
- რამდენი ლუწი რიცხვია 1-დან N-მდე

4) PIN კოდის შემოწმება მაქსიმუმ 5 მცდელობით
მომხმარებელმა უნდა გამოიცნოს PIN კოდი (მაგალითად 1234). აქვს 5 მცდელობა.

- თუ PIN სწორია, დაბეჭდეთ "შესვლა ნებადართულია!" და გაჩერდეს loop (break)
- თუ PIN არასწორია და მცდელობები არ ამოიწურა, დაბეჭდეთ "არასწორი PIN! დარჩა X მცდელობა"
- თუ 5 მცდელობა ამოიწურა, დაბეჭდეთ "ანგარიში დაბლოკილია!"""


#დავალება 1

jami = 0

while True:
    ricxvi = int(input("შეიყვანე რიცხვი (0 = დასასრული): "))
    
    if ricxvi == 0:
        break
    elif ricxvi > 0:
        jami = jami + ricxvi

print("დადებითი რიცხვების ჯამი:", jami)

#დავალება 2

ricxvi = input("შეიყვანე რიცხვი: ")

raodanoba = len(ricxvi)

print("ციფრების რაოდენობა:", raodanoba)

#დავალება 3

n = int(input("შეიყვანე რიცხვი N: "))

kenti = 0
luwi = 0

for i in range(1, n + 1):
    if i % 2 == 0:
        luwi = luwi + 1
    else:
        kenti = kenti + 1

print("კენტი რიცხვები:", kenti)
print("ლუწი რიცხვები:", luwi)


#დავალება 4

swori_pin = "1234"
mcdeloba = 5

while mcdeloba > 0:
    pin = input("შეიყვანე PIN: ")
    
    if pin == swori_pin:
        print("შესვლა ნებადართულია!")
        break
    else:
        mcdeloba = mcdeloba - 1
        if mcdeloba == 0:
            print("ანგარიში დაბლოკილია!")
        else:
            print("არასწორი PIN! დარჩა", mcdeloba, "მცდელობა")
