"""1)მომხმარებელს შემოატანინეთ რიცხვი
დაბეჭდეთ ამ რიცხვის გამრავლების ტაბულა 1-დან 10-მდე
ფორმატით: 3 x 1 = 3

მაგალითი n=3:
3 x 1 = 3
3 x 2 = 6
3 x 3 = 9
... და ასე 10 ის ჩათვლით

2)შექმენით პროგრამა რომელიც:
- გაივლის რიცხვებს 1-დან 50-მდე
- თუ რიცხვი იყოფა 3-ზეც და 5-ზეც - დაბეჭდოს "FizzBuzz"
- თუ მხოლოდ 3-ზე იყოფა - დაბეჭდოს "Fizz"
- თუ მხოლოდ 5-ზე იყოფა - დაბეჭდოს "Buzz"
- სხვა შემთხვევაში - დაბეჭდოს რიცხვი

3)მომხმარებელს შემოატანინეთ რიცხვი n
დახატეთ სამკუთხედი რომელიც იწყება n ვარსკვლავით და მცირდება

მაგალითი n=5:
*****
****
***
**
*

4)მომხმარებელს შემოატანინეთ ორი რიცხვი.
დაითვალეთ ყველა ლუწი რიცხვის ჯამი ამ რიცხვების დიაპაზონში დაბეჭდეთ შედეგი. 

მაგალითი 5 და 50.
ლუწი რიცხვების ჯამი: 50
(6+8+10+12+14 = 50)"""

#დავალება 1

n = int(input("შეიყვანე რიცხვი: "))

for i in range(1, 11):
    print(n, "x", i, "=", n * i)

#დავალება 2

for i in range(1, 51):
    if i % 3 == 0 and i % 5 == 0:
        print("FizzBuzz")
    elif i % 3 == 0:
        print("Fizz")
    elif i % 5 == 0:
        print("Buzz")
    else:
        print(i)

#დავალება 3

n = int(input("შეიყვანე რიცხვი: "))

while n > 0:
    print("*" * n)
    n = n - 1


#დავალება 4

ricxvi1 = int(input("შეიყვანე პირველი რიცხვი: "))
ricxvi2 = int(input("შეიყვანე მეორე რიცხვი: "))

jami = 0

for i in range(ricxvi1, ricxvi2 + 1):
    if i % 2 == 0:
        jami = jami + i

print("ლუწი რიცხვების ჯამი:", jami)
