"""1)fruits = ["ვაშლი", "ბანანი", "ატამი", "ფორთოხალი", "ყურძენი"]

დაბეჭდეთ: პირველი ხილი,ბოლო ხილი, ბოლოდან მესამე, მეორედან ბოლომდე ყველა.

2) colors = ["წითელი", "ლურჯი", "მწვანე", "ყვითელი", "ნარინჯისფერი"]

 შეცვალეთ პირველი ფერი "თეთრით". შეცვალეთ მესამე ფერი "ვარდისფერით".  შეცვალეთ ბოლო ფერი "შავით" და  დაბეჭდეთ ახალი სია.

3)students = ["გიორგი", "ნინო", "დავითი", "მარიამი", "ლუკა"]

grades = [85, 90, 78, 92, 88, 76, 95, 89]

დაბეჭდეთ students სიის სიგრძე
 დაბეჭდეთ ბოლო სტუდენტი len()-ის გამოყენებით
 დაბეჭდეთ ბოლოდან მეორე len()-ის გამოყენებით
 დაბეჭდეთ grades-ის მე-3 ქულა 
დაბეჭდეთ grades-ის ბოლო ქულა 
შეცვალეთ grades-ის პირველი ქულა 100-ით
 დაბეჭდეთ grades-ის საშუალო 4 ქულა
დაბეჭდეთ grades-ის ყველა ქულა გარდა პირველი 2-ისა 9. დაბეჭდეთ grades სიის სიგრძე
მაქსიმალური ქულა
მინიმალური ქულა
ქულათა ჯამური რაოდენობა"""

#დავალება 1

fruits = ["ვაშლი", "ბანანი", "ატამი", "ფორთოხალი", "ყურძენი"]

print("პირველი ხილი:", fruits[0])
print("ბოლო ხილი:", fruits[-1])
print("ბოლოდან მესამე:", fruits[-3])
print("მეორედან ბოლომდე:", fruits[1:])

#დავალება 2

colors = ["წითელი", "ლურჯი", "მწვანე", "ყვითელი", "ნარინჯისფერი"]

colors[0] = "თეთრი"
colors[2] = "ვარდისფერი"
colors[-1] = "შავი"

print(colors)

#დავალება 3


students = ["გიორგი", "ნინო", "დავითი", "მარიამი", "ლუკა"]
grades = [85, 90, 78, 92, 88, 76, 95, 89]

# სტუდენტების სიგრძე
print("სიის სიგრძე:", len(students))

# ბოლო სტუდენტი len()-ით
print("ბოლო სტუდენტი:", students[len(students)-1])

# ბოლოდან მეორე len()-ით
print("ბოლოდან მეორე:", students[len(students)-2])

# grades მე-3 ქულა
print("მე-3 ქულა:", grades[2])

# grades ბოლო ქულა
print("ბოლო ქულა:", grades[-1])

# პირველი ქულა შეცვლა
grades[0] = 100
print("შეცვლილი grades:", grades)

# საშუალო 4 ქულა
print("საშუალო 4 ქულა:", grades[0:4])

# ყველა ქულა პირველი 2-ის გარდა
print("პირველი 2-ის გარდა:", grades[2:])

# სიის სიგრძე
print("grades სიგრძე:", len(grades))

# მაქსიმალური
print("მაქსიმალური ქულა:", max(grades))

# მინიმალური
print("მინიმალური ქულა:", min(grades))

# ჯამი
print("ქულათა ჯამი:", sum(grades))


